
## Plan Result (terraform/cloudflare/cube-unit.net/dns)

[CI link](https://github.com/shimosyan/cube-unit.net/actions/runs/18617394628)


<pre><code>Plan: 1 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * cloudflare_dns_record._apple-business-manager_txt


<details><summary>Change Result (Click me)</summary>

```hcl

  # cloudflare_dns_record._apple-business-manager_txt will be created
  + resource "cloudflare_dns_record" "_apple-business-manager_txt" {
      + content     = "\"apple-domain-verification=ZzH3yQaXcxZSsoim\""
      + created_on  = (known after apply)
      + id          = (known after apply)
      + meta        = (known after apply)
      + modified_on = (known after apply)
      + name        = "cube-unit.net"
      + proxiable   = (known after apply)
      + proxied     = false
      + settings    = {
          + flatten_cname = (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        }
      + tags        = []
      + ttl         = 3600
      + type        = "TXT"
      + zone_id     = "4cf6092c08d51bb2492987f7afff6db3"
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

</details>




## :warning: Errors

* failed to add a label terraform/cloudflare/cube-unit.net/dns/add-or-update: label name is too long (max: 50)
<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":226,"Program":"tfcmt","SHA1":"8da6ecdcee07537d05b474fe377c9b1445170505","Target":"terraform/cloudflare/cube-unit.net/dns","Vars":{},"WorkflowName":"Pull Request"} -->